# StructuralBeamStartSupport Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralBeamStartSupport Property
ParameterTypeId Class See Also
---
"Beam Start Pocket Seat"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralBeamStartSupport { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralBeamStartSupport As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralBeamStartSupport {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace